app/controllers/animals_controller.rb

  def create
    @animal=Animal.new(animal_params)
    if @animal.save
---
INSERT INTO "animals" ("friends", "name") VALUES ($1, $2) RETURNING "id"  [["friends", 0], ["name", "reksio"]]